[
    {
        "version": "1.1.0",
        "descriptions": [
            "🚀 音声合成モデルのロード・アンロードが可能な API を追加",
            "🚀 AivisHub 上の最新バージョンの音声合成モデルに更新する API を追加",
            "🚀 ユーザー辞書への単語登録・変更時、複数のアクセント句を持つ単語に対応",
            "🚀 ユーザー辞書機能で対応する品詞の種類を拡充",
            "✨ ユーザー辞書に英単語を含む単語を追加した際に、正常に辞書の読み・アクセントが反映されるように改善",
            "✨ 内蔵辞書の精度を改善（いくつかの誤った読みが推定されるパターンが修正されます）",
            "✨ 音声合成エンジンを更新し、英単語・固有名詞・記号混じりの文をより正しく読めるように大幅に改善",
            "✨ 音声の前後の無音を自動トリミングし、不要な無音を削除",
            "✨ HTTPS 通信時にシステムにインストールされた証明書ストアを使うことで、HTTPS プロキシ環境でも通信できるように改善",
            "⚡ モデル情報のキャッシュ機能を追加し、前回起動時の情報を活用してエンジン起動を大幅に高速化",
            "⚡ BERT モデルを FP16 化し、メモリ消費量を大幅に削減",
            "⚡ 前回起動時に作成したコンパイル済みのユーザー辞書データを使い回すように改善し、エンジン起動速度を向上",
            "⚡ 音声合成結果を一時ファイルに書き込まずインメモリで返すように改善し、パフォーマンスを向上",
            "✅ デフォルトモデルは定義順に並び替え、その他のモデルより上位に表示する",
            "✅ インストール済みモデルが AivisHub に存在しないプライベートモデルかを示す情報を追加",
            "✅ Windows でエンジンの多重起動を可能にする",
            "✅ Linux arm64 版のパッケージをビルドする",
            "🛠️ 初期の v1.1.0-dev (1月頃) 以来、登録したプリセットが次回起動時に全て消滅していた重大なバグを修正",
            "🛠️ GPU 利用時、エディタ側で数十件同時に「音声を全部書き出し」を実行するとエンジンごとクラッシュすることがある問題を修正",
            "🛠️ 空文字が入力された時にノイズ音が合成される問題を修正",
            "🛠️ テキストの末尾に全角スペースが付与されていると音声合成に失敗する不具合を修正",
            "🛠️ 話速に 0 が指定された場合に発生するエラーを修正",
            "🛠️ 二連続ダッシュの後に特定の文字が来るとエラーが発生する問題を修正",
            "🛠️ 音声合成モデルのアンインストール時に既にモデルがロードされている場合、モデルをアンロードできなくなる問題を修正",
            "🛠️ 音声合成モデルのインストール/アンインストール後にエディタ側で更新情報が反映されなくなる問題を修正",
            "🛠️ プリセットファイルの保存先をユーザーディレクトリに変更し、権限問題を回避",
            "🛠️ 音声合成モデルファイルのダウンロードに失敗した場合、3回までリトライする",
            "🛠️ 音声合成モデルファイルインストール時に PC のストレージ容量が不足した際のエラーハンドリングを追加",
            "🛠️ Windows 上で localhost でアクセスした際の IPv6/IPv4 接続遅延を改善",
            "🛠️ オフライン環境で音声合成モデルのロードに1分余計に待たされる問題を修正",
            "🛠️ オフライン環境でのエラー発生時のログ出力を改善",
            "🛠️ 既存のユーザー辞書の移行ロジックを強化",
            "🛠️ 特定条件でユーザー辞書が適切に反映されない問題を修正",
            "🛠️ ユーザー辞書ファイルが破損している場合に起動できないのを修正",
            "🛠️ 初回起動時の辞書データ書き込みに失敗する問題を修正",
            "🛠️ そのほか、様々な不具合を修正",
            "⬆️ VOICEVOX ENGINE 0.24.0 ベースに更新",
            "⬆️ 依存ライブラリを更新"
        ],
        "contributors": ["tsukumijima", "sevenc-nanashi", "f0reachARR", "VOICEVOX ENGINE Contributors"]
    },
    {
        "version": "1.0.0",
        "descriptions": [
            "初回リリース。"
        ],
        "contributors": ["tsukumijima", "VOICEVOX ENGINE Contributors"]
    }
]
